Revit 2027 API
SpecTypeId.PowerPerLength Property
 Power per Length, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PowerPerLength { get; }
Public Shared ReadOnly Property PowerPerLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PowerPerLength {
	ForgeTypeId^ get ();
}
static member PowerPerLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace